[{"title":"MLY -- Scale drivers machine learning progress","date":"2017-01-27T02:39:40.000Z","path":"2017/01/27/MLY-Scale-drivers-machine-learning-progress/","text":"深度学习（神经网络）的很多想法已经存在几十年了，为什么这些想法现在才流行起来？促使机器学习进来的进步的两大因素是： 可得到的数据。现在，人们会花费更多的时间在数字设备上（例如笔记本，手机）。人们的数字行为产生了大量的数据，而这些数据可以用来训练我们的学习算法。 计算的规模。 也就是在近几年，我们才有能力训练足够大的神经网络，以利用我们拥有的巨大的数据集。","tags":[{"name":"翻译","slug":"翻译","permalink":"https://mengmengmiao.github.io/tags/翻译/"}]},{"title":"MLY -- Prerequisites and Notation","date":"2017-01-27T01:47:11.000Z","path":"2017/01/27/MLY-Prerequisites-and-Notation/","text":"如果你学习过机器学习课程，或者有使用监督学习的经验，你将能够更好理解这本书。本书中，我在讲述下面的章节时，会假设你对监督学习很熟悉。监督学习是在有标签的数据(x,y)中学习从x映射到y的一个函数，线性回归、逻辑回归、神经网络都是监督学习算法。目前存在很多机器学习的形式，但机器学习产生的实际价值多数都是监督学习带来的。在这本书中，我将会多次提到神经网络（即深度学习）。为学习这本书，你需要对神经网络（或深度学习）有一个基本的理解。如果你对神经网络（或深度学习）不理解，你可以看Coursera上的机器学习的前三个星期的课程，网址是http://ml-class.org","tags":[{"name":"翻译","slug":"翻译","permalink":"https://mengmengmiao.github.io/tags/翻译/"}]},{"title":"MLY -- How to use this book to help your team?","date":"2017-01-25T13:47:08.000Z","path":"2017/01/25/Machine-Learning-Yearning-How-to-use-this-book-to-help-your-team/","text":"在读完这本书后，你将会对“如何为机器学习项目设定技术方向”有一个深入的理解。但是你的队友可能不理解你为什么偏向那个技术方向，例如你想让你队友们定义一个单数评价矩阵，但是他们对此不信服。你将会如何说服他们？这就是我将章节设置得如此短的原因：你可以将1-2页的内容打印出来，让你的队友读一读。对事务优先级的改变，将对你的团队的工作效率有很大的影响。多提几个对团队有帮助的改变策略，你就会成为众人眼中的超人啦！","tags":[{"name":"翻译","slug":"翻译","permalink":"https://mengmengmiao.github.io/tags/翻译/"}]},{"title":"MLY -- Why Machine Learning Strategy?","date":"2017-01-25T13:42:47.000Z","path":"2017/01/25/Machine-Learning-Yearning-Why-Machine-Learning-Strategy/","text":"机器学习是很多应用的基础，如网页搜索，反垃圾邮件，语音识别，推荐系统等。如果你的团队正在做一个基于机器学习的应用，这本书能够帮你的团队取得快速的进步。 一个例子：提供猫图片的创业公司假如你现在正在创建一个为猫奴提供很多猫图片的公司，你用神经网络建立一个从图片中检测猫的计算机视觉系统。但悲剧的是，你发现你的学习算法精度不够，面临提高猫检测器精度的巨大压力，你要怎么做？你的小团队很给力，他们提出以下解决问题的方向： 收集更多数据：收集更多猫的图片 收集多样化训练数据：例如，收集具有不同姿势的猫图片；收集具有不同毛色的猫图片；收集拍摄时相机参数设置不同的图片 训练时间长一点儿：将梯度下降法的循环次数设置多一点儿 尝试更大的神经网络，所谓更大是指层数更多或者说隐藏单元更多或者说权重参数更多。 尝试更小的神经网络 尝试添加正则化项（例如L2正则） 改变神经网络的结构（例如改变激活函数，隐藏单元等） …… 在以上所述的方向中，如果能你能选择一个正确的方向，你将会建立一个领先于他人的猫图片平台，你的创业公司也会成功。若你选择一个不好的方向，你可能会浪费几个月。你将如何处理？这本书将会告诉你如何处理。对于多数机器学习问题，我们都能找到一些线索，这些线索能够告诉我们什么是有效的尝试，什么是无效的尝试。学会解读这些线索，将可能节约你数月甚至数年的开发时间。","tags":[{"name":"翻译","slug":"翻译","permalink":"https://mengmengmiao.github.io/tags/翻译/"}]},{"title":"Machine Learning Yearning 目录","date":"2017-01-25T13:11:50.000Z","path":"2017/01/25/this-is-meng/","text":"寒假，玩心太重，无法静下心来看一篇论文。翻译一下Machine Learning Yearning，期待能坚持下去。 为何需要机器学习策略？ 如何用这本书帮助你的团队？ 预备知识和符号约定 规模（scale）促使机器学习进步","tags":[{"name":"翻译","slug":"翻译","permalink":"https://mengmengmiao.github.io/tags/翻译/"}]}]