[{"title":"MLY -- 5.your development and test sets","date":"2017-01-28T02:52:40.000Z","path":"2017/01/28/MLY-5-your-development-and-test-sets/","text":"让我们回想一下猫图片那个例子：你们公司运行一个手机app，用户往app上上传许多不同物体的图片，而你想从这些图片中让机器自动找到猫图片。你的团队从不同的网站上获得了包含猫的图片（正样例）和不包含猫的图片（负样例）。然后将70%的图片用作训练集，30%的图片用作测试集。使用这些图片，你的团队构建了一个猫检测器，这个检测器在训练集和测试集上表现很好。但是，当你将这个分类器发布到移动端app时，其表现却很差。为什么会这样？你发现用户上传的图片与组成训练集的图片有不同的外观：用户上传的图片是用手机拍摄的，因此图片分辨率较低，模糊，并且光线不太理想。因你的训练/测试集都是由网站上的图片组成的，所以由训练集训练除的算法不能很好地泛化到手机图片的分布。在大数据时代之前，在机器学习中，随机70%/30%分割数据集为训练集和测试集是一个常见规则。这种规则可行，但是，在越来越多的“训练时的分布（例如上例网站图片）和最终关心的问题的分布（上例的手机图片）是不同的”应用上， 这种规则却不是一个好主意。我们通常定义： 训练集 – 用来训练你的学习算法 开发集(development set) – 用来调整参数，选择特征，根据学习算法做出其他决定。有时也叫hold-out交叉验证集。 测试集 – 用来评价学习算法的表现，不能将其用于对学习算法和算法参数的选择。 一旦你们定义里开发集和测试集，你的团队就可以尝试不同的ideas（例如，不同的学习算法参数），从而发现哪种ideas表现最好。开发集和测试集能使你的团队快速地看到你们的学习算法表现的怎么样。换句话来说，开发集和测试集能指引你的团队对机器学习系统做出最重要的改变。所以，你应该做到： 选择的开发集和测试集能够反映你期望将来能得到的并且算法在上面表现不错的数据的特点。换句话说，你的测试集不应该只是可利用的数据的30%，特别是将来的数据（移动端app图像）和你的训练数据（网站图像）不同时。如果你还没有发布app，没有用户的你可能不能得到能够精确反映算法将来处理的数据的数据集。但是，你可以尝试得到一些近似数据。例如，拉上你的亲朋好友，让他们用手机拍照片并传给你。一旦你的app发布了，你就能够根据用户的数据更新你的开发/测试数据集啦！假如，你没有任何途径能够得到一些近似数据，你也可以使用网站图像先开始。但你应该意识到，这会导致系统的泛化能力不好。我们需要判断一下，在构建很棒的开发集和测试集上应该投资多少。但是不要妄想训练时的分布和测试的分布相同。尝试挑选能够反映“算法最终能在其上表现好的数据”的样例，而不是你碰巧得到的什么数据（这里的for training应该理解成整个训练过程，包括训练，交叉验证和测试）。","tags":[{"name":"翻译","slug":"翻译","permalink":"https://mengmengmiao.github.io/tags/翻译/"}]},{"title":"MLY翻译 -- 4.Scale drivers machine learning progress","date":"2017-01-27T02:39:40.000Z","path":"2017/01/27/MLY-Scale-drivers-machine-learning-progress/","text":"深度学习（神经网络）的很多想法已经存在几十年了，为什么这些想法现在才流行起来？促使机器学习进来的进步的两大因素是： 可得到的数据。现在，人们会花费更多的时间在数字设备上（例如笔记本，手机）。人们的数字行为产生了大量的数据，而这些数据可以用来训练我们的学习算法。 计算的规模。 也就是在近几年，我们才有计算能力训练足够大的神经网络，这种足够大的网络能利用我们拥有的巨大的数据集。 具体来说，即使你积累了更多数据，把这些数据用于训练旧的学习算法（例如逻辑回归），这些算法仍然表现平平。即旧的学习算法的学习曲线是“平坦”的，即使你给它更多数据，它仍然停止增长。这种情况就像旧算法不知道如何处理我们现在拥有的数据似的。对于同样的监督学习任务，如果我们训练一个小的神经网络，将会得到一个稍微好点的结果：这里，小的神经网络是指神经网络的隐藏单元/层/参数较小。如果你训练越来越大的神经网络，你将会得到越来越好的结果[注释1]。因此，当有（i）训练一个非常大的网络（训练过程会遵循上图中的绿色曲线）；(ii)拥有大规模数据 这两个条件满足时，你将得到最好的表现。还有一些其他的细节，例如神经网路的结构也很重要，并且在这个领域中有很多创新工作的提出。但目前来说，提高网络表现性能的相对可靠地方法就是(i)训练更大的网络(ii)收集更多数据。满足条件（i）和（ii）的过程是相当复杂的，本书将详细讨论如何完成这项工作的细节。首先，我们将从既能用于传统学习算法又能用于神经网络的通用策略开始，然后讲述构建深度学习系统的最现代的策略。[注释1]: 下图表示神经网络在小规模数据中表现挺好。但这种好的程度，不如神经网络在大规模数据中的表现好的程度（可以看出随着数据规模增大，Large NN倾斜越大）。在小规模数据中，传统算法表现的好与不好取决于如何手工设计特征。例如，如果你有20个训练样例，选择逻辑回归还是神经网络并不重要，手工设计特征将比选择算法对结果影响更大。但是如果有100万样例，还是选择神经网络把。","tags":[{"name":"翻译","slug":"翻译","permalink":"https://mengmengmiao.github.io/tags/翻译/"}]},{"title":"MLY翻译 -- 3.Prerequisites and Notation","date":"2017-01-27T01:47:11.000Z","path":"2017/01/27/MLY-Prerequisites-and-Notation/","text":"如果你学习过机器学习课程，或者有使用监督学习的经验，你将能够更好理解这本书。本书中，我在讲述下面的章节时，会假设你对监督学习很熟悉。监督学习是在有标签的数据(x,y)中学习从x映射到y的一个函数，线性回归、逻辑回归、神经网络都是监督学习算法。目前存在很多机器学习的形式，但机器学习产生的实际价值多数都是监督学习带来的。在这本书中，我将会多次提到神经网络（即深度学习）。为学习这本书，你需要对神经网络（或深度学习）有一个基本的理解。如果你对神经网络（或深度学习）不理解，你可以看Coursera上的机器学习的前三个星期的课程，网址是http://ml-class.org","tags":[{"name":"翻译","slug":"翻译","permalink":"https://mengmengmiao.github.io/tags/翻译/"}]},{"title":"MLY翻译 -- 2.How to use this book to help your team?","date":"2017-01-25T13:47:08.000Z","path":"2017/01/25/Machine-Learning-Yearning-How-to-use-this-book-to-help-your-team/","text":"在读完这本书后，你将会对“如何为机器学习项目设定技术方向”有一个深入的理解。但是你的队友可能不理解你为什么偏向那个技术方向，例如你想让你队友们定义一个单数评价矩阵，但是他们对此不信服。你将会如何说服他们？这就是我将章节设置得如此短的原因：你可以将1-2页的内容打印出来，让你的队友读一读。对事务优先级的改变，将对你的团队的工作效率有很大的影响。多提几个对团队有帮助的改变策略，你就会成为众人眼中的超人啦！","tags":[{"name":"翻译","slug":"翻译","permalink":"https://mengmengmiao.github.io/tags/翻译/"}]},{"title":"MLY翻译 -- 1.Why Machine Learning Strategy?","date":"2017-01-25T13:42:47.000Z","path":"2017/01/25/Machine-Learning-Yearning-Why-Machine-Learning-Strategy/","text":"机器学习是很多应用的基础，如网页搜索，反垃圾邮件，语音识别，推荐系统等。如果你的团队正在做一个基于机器学习的应用，这本书能够帮你的团队取得快速的进步。 一个例子：提供猫图片的创业公司假如你现在正在创建一个为猫奴提供很多猫图片的公司，你用神经网络建立一个从图片中检测猫的计算机视觉系统。但悲剧的是，你发现你的学习算法精度不够，面临提高猫检测器精度的巨大压力，你要怎么做？你的小团队很给力，他们提出以下解决问题的方向： 收集更多数据：收集更多猫的图片 收集多样化训练数据：例如，收集具有不同姿势的猫图片；收集具有不同毛色的猫图片；收集拍摄时相机参数设置不同的图片 训练时间长一点儿：将梯度下降法的循环次数设置多一点儿 尝试更大的神经网络，所谓更大是指层数更多或者说隐藏单元更多或者说权重参数更多。 尝试更小的神经网络 尝试添加正则化项（例如L2正则） 改变神经网络的结构（例如改变激活函数，隐藏单元等） …… 在以上所述的方向中，如果能你能选择一个正确的方向，你将会建立一个领先于他人的猫图片平台，你的创业公司也会成功。若你选择一个不好的方向，你可能会浪费几个月。你将如何处理？这本书将会告诉你如何处理。对于多数机器学习问题，我们都能找到一些线索，这些线索能够告诉我们什么是有效的尝试，什么是无效的尝试。学会解读这些线索，将可能节约你数月甚至数年的开发时间。","tags":[{"name":"翻译","slug":"翻译","permalink":"https://mengmengmiao.github.io/tags/翻译/"}]},{"title":"MLY翻译 -- Machine Learning Yearning 目录","date":"2017-01-25T13:11:50.000Z","path":"2017/01/25/this-is-meng/","text":"寒假，玩心太重，无法静下心来看一篇论文。翻译一下Machine Learning Yearning，期待能坚持下去。 为何需要机器学习策略？ 如何用这本书帮助你的团队？ 预备知识和符号约定 规模（scale）促使机器学习进步","tags":[{"name":"翻译","slug":"翻译","permalink":"https://mengmengmiao.github.io/tags/翻译/"}]}]